# -----------------------------------------------------------------
# 1. 使うプロバイダー（AWS）の宣言
# -----------------------------------------------------------------
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.0" # AWSプロバイダーのバージョンを指定 (例: 5系)
    }
  }
}

# -----------------------------------------------------------------
# 2. プロバイダー（AWS）の設定
# -----------------------------------------------------------------
provider "aws" {
  # デフォルトのリージョン
  region  = "ap-northeast-1"

  # 使用するAWSプロファイル
  profile = "proj-ndk-ky"
}